var book = [];

book
.push("9787513306775") // 占星术杀人魔法
.push("9787122346032") // 克莱因壶
.push("9787532175512") // 消失的13级台阶
.push("9787108037909") // 叫魂
.push("9787229030933") // 三体Ⅲ
.push("9787536693968") // 三体Ⅱ
.push("9787536692930") // 三体
.push("9787800479212") // 清代史事与人物
.push("9787513403788") // 胤禛美人图揭秘
.push("9787561175316") // 平面国
.push("9787547011157") // 三重门
.push("9787101120066") // 新五代史
.push("9787513317276") // 慈禧全传
.push("9787108024176") // 灯火楼台
.push("9787108024190") // 红顶商人
.push("9787108024213") // 胡雪岩
.push("9787108024268") // 水龙吟
.push("9787108024282") // 苏州格格
.push("9787108024299") // 印心石
.push("9787503311864") // 亮剑
.push("9787513400152") // 宫女谈往录
.push("9787506365604") // 在细雨中呼喊
.push("9787551812665") // 老残游记
.push("9787108006691") // 鹿鼎记
.push("9787108006721") // 天龙八部
.push("9787108006684") // 倚天屠龙记
.push("9787108006660") // 神雕侠侣
.push("9787108006639") // 笑傲江湖
.push("9787533946661") // 蛙
.push("9787533946647") // 檀香刑
.push("9787533946722") // 红高粱家族
.push("9787513312929") // 无人生还
.push("9787506360876") // 陆犯焉识
.push("9787506390491") // 第九个寡妇
.push("9787506390507") // 小姨多鹤
.push("9787108042453") // 我们仨
.push("9787540480257") // 骆驼祥子
.push("9787534618727") // 草房子
.push("9787020073788") // 额尔古纳河右岸
.push("9787020049394") // 尘埃落定
.push("9787535486752") // 一句顶一万句
.push("9787503946882") // 一百个人的十年
.push("9787530210291") // 1984
.push("9787532751457") // 动物农场
.push("9787500627098") // 沉默的大多数
.push("9787532751471") // 局外人
.push("9787544766999") // 守望之心
.push("9787544766500") // 杀死一只知更鸟
.push("9787201077635") // 了不起的盖茨比
.push("9787532763696") // 卡拉马佐夫兄弟
.push("9787530216033") // 许三观卖血记
.push("9787530215593") // 活着
.push("9787530208694") // 半生缘
.push("9787530208656") // 倾城之恋
.push("9787200076288") // 采桑子
.push("9787540491956") // 城南旧事
.push("9787530640470") // 呼兰河传
.push("9787544711296") // 麦田里的守望者
.push("9787532738151") // 洛丽塔
.push("9787208061644") // 追风筝的人
.push("9787020090006") // 围城
.push("9787544258975") // 霍乱时期的爱情
.push("9787542631664") // 送你一颗子弹
.push("9787506069113") // 圆舞
.push("9787544291163") // 白夜行
.push("9787532753741") // 月亮和六便士
.push("9787020095223") // 白鹿原
.push("9787563932238") // 黄金时代
.push("9787511811097") // 九栋
.push("9787544270878") // 解忧杂货店

loadBook( book );

function loadBook( book ) {
    var text = '[';
    for (var i = 0; i < book.length; i++) {
        text += getFromISBN( book[i] );
        console.log( book[i] );
        sleep(5000);
    }
    text = text.slice(0,text.length-1) +  ']';
    
    ( text );
}

// 通过ISBN获取信息
function getFromISBN( isbn ) {
    var res;
    $.ajax({
        url: "https://api.jike.xyz/situ/book/isbn/" + isbn,
        async: false,
        dataType: 'json',
        success: function( obj ) {
            if (obj.msg == "请求成功") {
                res = '{"name":"' + removeParent(obj.data.name) + '","author":"' + removeParent(obj.data.author) + '","photoUrl":"https://i0.wp.com/' + obj.data.photoUrl.replace('https://','') + '","doubanUrl":"https://book.douban.com/subject/' + obj.data.douban + '/"},';
            }
        } 
    });
    return res;
}

// 处理文本
function removeParent(str) {
    if(str.indexOf("[]")!=-1) {
        return str.replaceAll("\\s*\\[[^\\]]*\\]\\s*", "");
    } else if(str.indexOf("()")!=-1) {
        return str.replaceAll("\\s*\\([^\\)]*\\}\\s*", "");
    } else {
        return str.replaceAll("\\s*\\{[^\\}]*\\)\\s*", "");
    }
}

// 睡眠
function sleep(ms) {
    for (var t = Date.now(); Date.now()-t<=ms;);
}